/**
 * 1. api - fetch()
 * 2. forEach
 * 3. map
 * 4. join()
 * 5. push()
 * 6. filter()
 * 7. find()
 */

const data = [
  {
    title:
      "'হুট করে একদিন চাকরি নাই, দুই-তিন মাস বাড়িতে বসে থাকা তো মানসিকভাবে বিরাট আঘাত'",
    id: "c3r4r51n9lno",
    createdAt: "2025-09-04T12:43:26.632Z",
  },
  {
    title:
      "ইউক্রেন চুক্তি না মানলে লক্ষ্য পূরণে সামরিক ব্যবস্থা নেবে রাশিয়া, চীন থেকে পুতিনের হুমকি",
    id: "c0kn4z3rnj1o",
    createdAt: "2025-09-04T12:43:28.080Z",
  },
  {
    title: "ভারত-চীন সম্পর্কে নতুন মোড় কী বার্তা দিচ্ছে পাকিস্তানকে",
    id: "cwy3yy82gpko",
    createdAt: "2025-09-04T12:43:29.756Z",
  },
  {
    title:
      "বাংলাদেশ-পাকিস্তানে 'ধর্মীয় নিপীড়নের' শিকার সংখ্যালঘুদের ভারতের নতুন আইনে ছাড়",
    id: "cderyyz38p9o",
    createdAt: "2025-09-04T12:43:30.288Z",
  },
  {
    title:
      "প্রশাসনে লটারির মাধ্যমে পোস্টিং নয়, পুলিশে যুক্ত হচ্ছেন চার হাজার নতুন এএসআই",
    id: "c2l7lly50rwt",
    createdAt: "2025-09-04T12:43:32.136Z",
  },
  {
    title: "মার্কিন নেতৃত্বাধীন বিশ্বব্যবস্থার বিরুদ্ধে চীনের জোরালো বার্তা",
    id: "c4gve3nxd24o",
    createdAt: "2025-09-04T12:43:32.734Z",
  },
  {
    title:
      "বাবাকে নজরবন্দি, ভাইদের আটক - সৌদি রাজতন্ত্রে যেভাবে ক্ষমতাধর হয়ে ওঠেন মোহাম্মদ বিন সালমান",
    id: "c1mpmx9dvrgo",
    createdAt: "2025-09-04T12:43:33.246Z",
  },
];

// 🔹 for loop
for (let i = 0; i < data.length; i++) {
  console.log(data[i]);
}

// 🔹 for...of loop
for (let d of data) {
  console.log(d);
}

// 🔹 forEach (কোনো return করে না)
data.forEach((d) => {
  console.log(d);
});

// 🔹 map (new array return করে)
const titleArr = data.map((d) => `<span>${d.title}</span>`);
console.log(titleArr);

// 🔹 join()
const greetings = ["hello", "hi", "abcd"];
console.log(greetings.join("-")); // hello-hi-abcd

// 🔹 push()
data.push(10);
data.push(20);
data.push({
  title: "this is a title",
});
console.log(data);

// 🔹 filter()
const numbers = [1, 2, 3, 3, 3, 4, 5, 6, 7];
const filteredArray = numbers.filter((num) => num !== 3);
console.log(filteredArray); // [1, 2, 4, 5, 6, 7]

const filteredData = data.filter((d) => d.id !== "c3r4r51n9lno");
console.log(filteredData);

// 🔹 find()
const foundData = data.find((d) => d.id === "c1mpmx9dvrgo");
console.log(foundData);

if (foundData) {
  console.log("Paaoa geche...");
} else {
  console.log("Paoa jayni...");
}

// 🔹 forEach দিয়ে HTML string বানানো
const words = ["hello", "hi", "dhjdgh"];
let container = "";

words.forEach((a) => {
  container = container + `<span>${a}</span>`;
});

console.log(container);
